/* rollout unfinished label addition */
" - Rollout Unfinished" = " - Rollout Unfinished";

/* 2step phone part of secret */
"2step_phonepart_dialog_title" = "Your part of the secret";

/* Add Token manually */
"addManually_button_label" = "Add token manually";

/* allow button label */
"allow" = "Allow";

/* authenticating label text */
"authenticating" = "Authenticating...";

/* Authentication failed! */
"authentication_failed_toast" = "Authentication failed!";

/* Authentication successful! */
"authentication_successful_toast" = "Authentication successful!";

/* cancel button label */
"cancel" = "Cancel";

/* removal confirmation dialog title */
"confirmation" = "Confirmation";

/* delete button / row action text */
"delete" = "Delete";

/* enter button dialog text */
"enter_button_dialogtext" = "Enter";

/* placeholder text for new name input field */
"enter_new_name_placeholder" = "Enter a new name";

/* error dialog title */
"error_title" = "Error";

/* new name is empty dialog text */
"new_name_empty_dialog_text" = "Invalid input";

/* new name is empty dialog title */
"new_name_empty_dialog_title" = "The new name can not be empty";

/* removal confirmation question (\(label) available) */
"removal_confirmation_question" = "Do you want to remove %@?";

/* row action rename text */
"rename" = "Rename";

/* rename dialog text (label will be appended */
"rename_dialog_text" = "Rename\n";

/* retry button label */
"retry" = "Retry";

/* rolling out label text */
"rolling_out" = "Rolling out...";

/* The secret is not a valid base32 string */
"secret_not_b32_dialog_text" = "The secret is not a valid base32 string";

/* sort list */
"sort_button_label" = "Sort List";

/* The privacyIDEA Authenticator uses the following third party libraries */
"third_party_label" = "The privacyIDEA Authenticator uses the following third party libraries:";

/* Legal Notices */
"thirdParty_button_label" = "Legal Notices";

/* ... has expired and will be deleted (label will be prepended) */
"token_expired_dialog_text" = "has expired and will be deleted";

/* token expired dialog title */
"token_expired_dialog_title" = "Token expired";

/* */
"rsa_key_generation_fail_title" = "Key Generation Failure";

/* */
"rsa_key_generation_fail_message" = "The key generation failed, rollout will be cancelled";

/* */
"2step_byte_generation_failed_title" = "Secret Generation Failure";

/* */
"2step_byte_generation_failed_message" = "The secret generation failed.\nDelete the token and try again.";

/* */
"publickey_not_found_message" = "The public key for the token was not found.\nTry enrolling a new token.";

/* */
"privatekey_not_found_message" = "The private key for the token was not found.\nTry enrolling a new token.";

/* */
"signature_invalid" = "The signature for this authentication request is invalid, it will be deleted.\nTry to authenticate again.";

/* */
"signing_error" = "The authentication could not be signed.\nTry enrolling a new token.";

/* */
"push_auth_ttl_expired" = "The authentication request has expired.\nTry to authenticate again.";

/* */
"push_enrollment_parameters_missing" = "Incomplete information for rollout.\nTry scanning again or contact the administrator.";

/* */
"unable_to_get_firebase_token" = "Unable to connect to Firebase Service, please try again later.";
